Tekla Open API Reference for Tekla Structures 2025
Events Methods
The Events type exposes the following members.
Methods
Name | Description
Dispose
 Disposes the instance.
InitializeLifetimeService
 Initializes the lifetime service.
 (Overrides MarshalByRefObject.InitializeLifetimeService().)
OnInterrupted
 Called when uesr interrupts.
OnModelSaveInfo
 Called when model is saved.
OnUndoClicked
 Called when user clicks undo.
Register
 Registers the instance to listen to the specified events. More event delegates should not be added without calling UnRegister first.
UnRegister
 Unregisters the instance from listening to events.
Top
See Also
Reference
Events Class
Tekla.Structures.Model Namespace